# core/llm_client/keywords.py

from enum import Enum

class KeywordSet(Enum):
    FIND_FILE_IN_FOLDER = "find_file_in_folder"
    FIND_TEXT_IN_FILES = "find_text_in_files"

KEYWORDS = {
    KeywordSet.FIND_FILE_IN_FOLDER: [
        "найди файл", "найди на компьюере", "найди на моем компьютере", "поиск файла", "где находится", "файл с названием", "файл с именем",
    ],
    KeywordSet.FIND_TEXT_IN_FILES: [
        "нужно найти строку",
        "найди строку",
        "поиск строки",
        "содержит строку",
        "в тексте есть",
        "поиск текста",
        "строка",
        "нужно найти строку",
        "найди строку",
        "поиск текста",
        "содержит тест",
        "в тексте есть",
        "текст",
        "нужно найти строку",
        "найди строку",
        "поиск строки",
        "содержит строку",
        "в тексте есть",
        "поиск текста",
        "строка",
        "нужно найти слова",
        "найди слова",
        "поиск слов",
        "содержит слова",
        "слова",
        "слово"
    ]
}